
d = {
    "周杰轮": {"语文": 99, "数学": 88, "英语": 22},
    "林军杰": {"语文": 88, "数学": 66, "英语": 21},
    "王力鸿": {"语文": 66, "数学": 11, "英语": 33},
}

# 新增元素
d["刘德滑"] = {"语文": 66, "数学": 78, "英语": 62}
print(d)

# 更新元素
d["王力鸿"] = {"语文": 99, "数学": 98, "英语": 66}
print(d)
# 更新和新增语法一致，当key不存在新增，当key存在则更新

# 删除某个key，并将其对应的value作为返回值提供
liudehua = d.pop("刘德滑")
print(d, liudehua)

# 清空
d.clear()
print(d)
d = {"a": 1, "b": 2}
d = {}      # 方法2
print(d)

# 得到全部的key
d = {
    "周杰轮": {"语文": 99, "数学": 88, "英语": 22},
    "林军杰": {"语文": 88, "数学": 66, "英语": 21},
    "王力鸿": {"语文": 66, "数学": 11, "英语": 33},
}
print(d.keys())     # 结果 dict_keys(['周杰轮', '林军杰', '王力鸿'])
# 字典.keys的结果可以被遍历

# 遍历字典方式1，可读性好
for key in d.keys():
    print(f"{key}: {d[key]}")

# 遍历字典方式2
# 直接对字典做 for x in 字典，得到的就是key
for key in d:
    print(f"{key}: {d[key]}")

# 得到字典长度（有多少个键值对）
print(len(d))
